{
  "backend/main.mo": "Motoko canister defining access‑controlled user profiles, membership registration, clubs, media-backed content sections, and branding with history and social links management.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related files, components, and test IDs for deployment and GSC verification.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend source files for reference in build planning.",
  "frontend/docs/android-apk-from-pwa.md": "Guide explaining how to wrap the deployed PWA into an Android APK using Trusted Web Activity and Bubblewrap.",
  "frontend/docs/production-deploy-google-search-console.md": "Deployment guide detailing production workflow and Google Search Console verification steps for versioned releases.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, dark mode tokens, and global UI styling.",
  "frontend/index.html": "Main HTML document setting SEO metadata, PWA tags, Google Search Console verification, and loading the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, icons, and display settings.",
  "frontend/public/robots.txt": "Robots file allowing crawlers while blocking /me/ paths and pointing to sitemap.xml.",
  "frontend/public/sitemap.xml": "XML sitemap listing public site routes with change frequency and priority values.",
  "frontend/public/sw.js": "Service worker implementing cache version v14 with network-first logic and static asset caching.",
  "frontend/scripts/run-prod-build-with-gsc-check.ts": "Node script that runs the production build and enforces Google Search Console meta tag verification, failing on errors.",
  "frontend/scripts/verify-gsc-meta.ts": "Checks dist/index.html for the required Google Search Console meta tag and exits with an error if missing.",
  "frontend/src/App.tsx": "Defines the application's full route tree using TanStack Router, mapping paths to page components.",
  "frontend/src/components/admin/MediaPicker.tsx": "Provides a media upload UI with validation, preview, and upload progress using ExternalBlob.",
  "frontend/src/components/AdminGuard.tsx": "Restricts access to admin-only pages and redirects unauthorized users to the admin login route.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with static links and dynamically loaded social media icons.",
  "frontend/src/components/HomeBottomNavMenu.tsx": "Provides a mobile bottom-sheet navigation menu linked to primary routes and the 'Me' section.",
  "frontend/src/components/InstallPromptBanner.tsx": "Displays a PWA installation banner when installable, allowing users to install or dismiss the prompt.",
  "frontend/src/components/SettingsSheet.tsx": "Offers theme toggling, share-link copying, and PWA installation options within a settings side sheet.",
  "frontend/src/components/TopNav.tsx": "Implements the main top navigation bar with branding, responsive menus, account controls, and settings access.",
  "frontend/src/config/branding.ts": "Returns the branding logo URL with a fallback default asset path.",
  "frontend/src/config/navLinks.ts": "Defines primary navigation links and a hook to return the correct '/me' link based on admin status.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAdminSession.ts": "Stores admin login state with hardcoded credentials using Zustand and sessionStorage persistence.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Handles PWA install prompt logic, tracking installability, dismissal, and user-triggered installation.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for branding, history content, memberships, and clubs via the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Stores and toggles light/dark theme while applying saved user preference.",
  "frontend/src/index.css": "Tailwind base and theme variables defining light/dark color palettes and typography styles.",
  "frontend/src/layouts/AppLayout.tsx": "Defines the main app layout with top navigation, routed content area, and footer.",
  "frontend/src/main.tsx": "Bootstraps the app with ReactDOM, wrapping it in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders a public About page with organization story and mission, vision, values cards using static content.",
  "frontend/src/pages/AdminAboutPage.tsx": "Provides an admin interface to load, edit, add, and save About sections with optional media and links.",
  "frontend/src/pages/AdminBrandingPage.tsx": "Admin page for updating organization branding, mainly uploading and saving a logo.",
  "frontend/src/pages/AdminClubsManagerPage.tsx": "Admin tool to create, edit, and delete clubs with full form handling and confirmation dialogs.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Main admin dashboard offering navigation to branding, home page, about content, and other management tools.",
  "frontend/src/pages/AdminHistoryEditorPage.tsx": "Provides an admin interface to edit history text and optional media, loading existing content and saving updates via mutations.",
  "frontend/src/pages/AdminHomePageEditorPage.tsx": "Allows admins to view, edit, add, and remove home page sections with text and images, then save them to the backend.",
  "frontend/src/pages/AdminLoginPage.tsx": "Implements the admin login form, handling credentials, authentication, loading state, and redirects on success.",
  "frontend/src/pages/AdminMembershipReviewPage.tsx": "Displays a list of membership registrations with contact details, handling loading and error states for admin review.",
  "frontend/src/pages/AdminSocialLinksPage.tsx": "Loads and edits social media link URLs, providing a form to update and save the organization's social profiles.",
  "frontend/src/pages/ClubDetailPage.tsx": "Displays detailed information for a single club, handling loading, error, and not‑found states using the club ID from route params.",
  "frontend/src/pages/ClubsPage.tsx": "Fetches and lists all clubs in a grid with loading, error, and empty states, linking to individual club detail pages.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact methods including email, phone, address, and office hours using card-based layout.",
  "frontend/src/pages/EventsPage.tsx": "Renders a list of upcoming static events with details like date, location, and type badges.",
  "frontend/src/pages/HistoryPage.tsx": "Loads and displays organizational history content with optional media and states for loading, errors, or empty content.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero section, dynamic about and homepage sections, and fallback content when backend data is missing.",
  "frontend/src/pages/MembershipRegistrationPage.tsx": "Renders a membership registration form with submission handling, success state, and an admin login link.",
  "frontend/src/pages/ProgramsPage.tsx": "Displays a grid of predefined youth programs with icons, descriptions, ages, and schedules.",
  "frontend/src/utils/media.ts": "Provides media file validation, conversion to Uint8Array, preview URL helpers, and type checks for images and videos.",
  "frontend/src/utils/seo.ts": "Updates canonical and Open Graph URLs and provides a helper to refresh SEO-related meta tags for the current route.",
  "frontend/src/utils/theme.ts": "Manages dark/light theme persistence in localStorage and applies the theme to the document root.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, persisting, and clearing URL parameters, with support for hash-based routing and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, radii, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Contains the project’s metadata, feature list, architectural notes, known issues, and generated assets for build and planning."
}