{
  "backend/main.mo": "Main canister actor defining data types, stable state, and admin‑gated CRUD APIs for events, APK URL, and other site content, integrating access control and blob storage.",
  "backend/migration.mo": "Migration module initializing a new empty events map when upgrading the canister.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend components, pages, hooks, and configuration files.",
  "frontend/docs/adsense.md": "Guide explaining how to enable and configure Google AdSense via environment variables.",
  "frontend/docs/android-apk-from-pwa.md": "Documentation describing how to generate an Android APK from the PWA using Trusted Web Activity and Bubblewrap.",
  "frontend/docs/production-deploy-google-search-console.md": "Instructions for production deployment and Google Search Console verification, including prerequisites and build steps.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and light/dark mode design tokens.",
  "frontend/index.html": "Main HTML entry file setting metadata, SEO tags, PWA configuration, and loading the React app.",
  "frontend/public/ads.txt": "Placeholder AdSense ads.txt file instructing users to replace it with their publisher ID.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining icons, colors, metadata, and display settings for the application.",
  "frontend/public/robots.txt": "Robots rules allowing crawlers while blocking admin routes and pointing to the sitemap.",
  "frontend/public/sitemap.xml": "Static sitemap listing public site URLs with change frequency and priority metadata.",
  "frontend/public/sw.js": "Implements a versioned PWA service worker with install, activate, and fetch handlers for caching static assets and using network-first strategies.",
  "frontend/scripts/run-prod-build-with-gsc-check.ts": "Runs the production build and enforces Google Search Console meta‑tag verification, exiting on any failure.",
  "frontend/scripts/verify-gsc-meta.ts": "Validates that the built index.html contains the required GSC verification meta tag and halts the build if missing.",
  "frontend/src/App.tsx": "Defines the application router and page routes using TanStack Router, mapping all public and admin pages.",
  "frontend/src/components/admin/MediaPicker.tsx": "Lets admins upload and preview images or videos with validation, progress tracking, and removal support.",
  "frontend/src/components/AdminGuard.tsx": "Protects admin routes by checking admin session status and redirecting unauthorized users to the login page.",
  "frontend/src/components/Footer.tsx": "Renders site footer with social links, quick links, branding, and share functionality.",
  "frontend/src/components/HomeBottomNavMenu.tsx": "Provides a mobile bottom navigation sheet that lists primary routes and the user’s Me link.",
  "frontend/src/components/InstallPromptBanner.tsx": "Displays a PWA install prompt banner with install and dismiss actions when the app is installable.",
  "frontend/src/components/SettingsSheet.tsx": "Provides a right-side settings panel with theme switch, share link, PWA install, and APK download actions.",
  "frontend/src/components/TopNav.tsx": "Renders the responsive top navigation bar with links, branding, mobile menu, share link, settings sheet, and logout handling.",
  "frontend/src/config/branding.ts": "Provides branding logo utilities with a fallback image path.",
  "frontend/src/config/navLinks.ts": "Defines primary navigation links and returns the correct 'Me' link based on admin status.",
  "frontend/src/config/publicSite.ts": "Exports the shared public production site URL constant.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAdminSession.ts": "Stores and persists simple admin login state using hardcoded credentials.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, status tracking, and stored identity loading via React context.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Handles PWA install prompt availability, installation detection, and user dismissal state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including branding, history, membership registrations, clubs, and more.",
  "frontend/src/hooks/useTheme.ts": "Handles theme state, applies the selected theme, and provides a light/dark toggle.",
  "frontend/src/index.css": "Sets global Tailwind layers and defines light/dark CSS variables and typography styles.",
  "frontend/src/layouts/AppLayout.tsx": "Provides the main app layout with top navigation, routed content, and a footer.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the public About page with story, mission, vision, and values sections.",
  "frontend/src/pages/AdminAboutPage.tsx": "Admin interface for editing About sections, including text, media, and ordering.",
  "frontend/src/pages/AdminAndroidApkPage.tsx": "Admin page for viewing and updating the Android APK download URL with validation and status messages.",
  "frontend/src/pages/AdminBrandingPage.tsx": "Admin page to load, display, and update branding media such as the organization logo with success and error feedback.",
  "frontend/src/pages/AdminClubsManagerPage.tsx": "Provides CRUD management for clubs, including forms for editing details and confirmation dialogs for deletion.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin landing page offering navigation to various content‑management tools like branding, home page, about, and more.",
  "frontend/src/pages/AdminEventsManagerPage.tsx": "Interface for creating, editing, validating, and deleting events, with form state management and confirmation dialogs.",
  "frontend/src/pages/AdminHistoryEditorPage.tsx": "Editor for updating the organization's history text and media, with loading, saving, and success feedback.",
  "frontend/src/pages/AdminHomePageEditorPage.tsx": "Implements an admin interface for viewing, editing, adding, and removing home page sections and saving them via API mutations.",
  "frontend/src/pages/AdminLoginPage.tsx": "Provides a login form for admins that authenticates via useAdminSession and redirects to the dashboard on success.",
  "frontend/src/pages/AdminMembershipReviewPage.tsx": "Displays and manages a list of membership registrations, including loading, error, and empty states.",
  "frontend/src/pages/AdminSocialLinksPage.tsx": "Allows admins to view and update social media link URLs with form handling, validation, and success/error feedback.",
  "frontend/src/pages/ClubDetailPage.tsx": "Fetches and displays detailed information about a specific club, including loading, error, and not-found states.",
  "frontend/src/pages/ClubsPage.tsx": "Displays a list of clubs with loading, error, empty states, and links to individual club pages, plus a call‑to‑action section.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact methods including email, phone, address, and office hours using card layouts.",
  "frontend/src/pages/EventsPage.tsx": "Fetches and displays upcoming events with date parsing, handling loading, error, and empty states.",
  "frontend/src/pages/HistoryPage.tsx": "Loads and displays organization history content with optional media and full handling of loading and error states.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, dynamic content sections from backend, and install/navigation components.",
  "frontend/src/pages/MembershipRegistrationPage.tsx": "Provides a membership registration form with submission handling, success state, and optional admin login link.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders a scrollable privacy policy page with sections describing data collection, usage, and disclosure.",
  "frontend/src/pages/ProgramsPage.tsx": "Displays a grid of youth programs with icons, descriptions, ages, schedules, and a call-to-action section.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Renders a scrollable terms of service page detailing user agreements, conduct rules, and usage restrictions.",
  "frontend/src/utils/adsense.ts": "Provides a function to inject the Google AdSense script once using a Vite environment variable.",
  "frontend/src/utils/media.ts": "Contains media file validation utilities, type checks, file conversion to Uint8Array, and preview URL helpers.",
  "frontend/src/utils/seo.ts": "Updates canonical and Open Graph URL meta tags for SEO, with helpers to apply changes for a given route path.",
  "frontend/src/utils/share.ts": "Implements URL sharing via the Web Share API with clipboard-based fallback and structured result reporting.",
  "frontend/src/utils/theme.ts": "Manages light/dark theme persistence in localStorage and applies the theme to the document root.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL parameters with session persistence and hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom fonts, OKLCH color variables, extended radii, shadows, and accordion animations with typography, container-queries, and animate plugins.",
  "project_state.json": "Defines current project state, including scope, architecture, known issues, features, and metadata for ongoing UI, deployment, and PWA improvements."
}