{
  "backend/main.mo": "Motoko canister defining types and stable vars for content, with admin‑gated CRUD for events, APK URL, and access‑controlled user profile queries.",
  "feature_evidence.json": "Placeholder feature evidence report with an empty features list.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all major frontend components, pages, hooks, and configuration files.",
  "frontend/docs/adsense.md": "Guide for enabling Google AdSense via environment variable and adding the client ID.",
  "frontend/docs/android-apk-from-pwa.md": "Instructions for generating an Android APK from the PWA using Bubblewrap and TWA.",
  "frontend/docs/custom-domain-yfo-dns-and-gsc.md": "Documentation for configuring yfo.org DNS and verifying the domain in Google Search Console.",
  "frontend/docs/production-deploy-google-search-console.md": "Production deployment checklist and Google Search Console verification steps for the IC site.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens and light/dark mode CSS variables.",
  "frontend/index.html": "Main HTML template configuring SEO, PWA meta tags, and root mount point.",
  "frontend/public/ads.txt": "Placeholder ads.txt file instructing replacement with real AdSense publisher entries.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining icons, colors, metadata, and categories for the YFO app.",
  "frontend/public/robots.txt": "Robots rules allowing crawlers but blocking /me/ admin routes and pointing to the sitemap.",
  "frontend/public/sitemap.xml": "Static sitemap listing all public site routes with update frequencies and priorities.",
  "frontend/public/sw.js": "Service worker caching static assets and handling fetch with network-first strategy while avoiding HTML caching.",
  "frontend/scripts/run-prod-build-with-gsc-check.ts": "Orchestrates the production build, logs steps, verifies build output, and runs a Google Search Console meta tag check.",
  "frontend/scripts/verify-gsc-meta.ts": "Checks dist/index.html for the required Google Search Console verification meta tag and exits on failure.",
  "frontend/src/App.tsx": "Defines the main React app routing structure using TanStack Router for public and admin pages.",
  "frontend/src/components/admin/MediaPicker.tsx": "Handles image/video selection, validation, upload progress, preview, and removal for admin media inputs.",
  "frontend/src/components/AdminGuard.tsx": "Protects admin routes by checking admin session and redirecting unauthorized users to the login page.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with social links, quick navigation, and share functionality.",
  "frontend/src/components/HomeBottomNavMenu.tsx": "Provides a mobile bottom navigation menu using a sheet component with dynamic routing.",
  "frontend/src/components/InstallPromptBanner.tsx": "Displays a PWA install banner with install and dismiss actions using the PWA install prompt hook.",
  "frontend/src/components/SettingsSheet.tsx": "Provides a settings panel with theme toggle, sharing tools, PWA install action, and APK download support.",
  "frontend/src/components/TopNav.tsx": "Implements the top navigation bar with branding, links, mobile menu, sharing, logout, and settings access.",
  "frontend/src/config/branding.ts": "Defines the default logo and returns branding logo URLs with fallback.",
  "frontend/src/config/navLinks.ts": "Declares primary navigation links and computes the appropriate user dashboard link based on admin status.",
  "frontend/src/config/publicSite.ts": "Exports the public site URL with optional environment override.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdminSession.ts": "Stores admin login state with hardcoded credentials using persisted Zustand storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity, and state management.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Provides a hook that manages the PWA install prompt, tracks installability, and handles user dismissal.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks for fetching and mutating backend data such as branding, history, memberships, and clubs.",
  "frontend/src/hooks/useTheme.ts": "Implements a theme hook that applies and toggles between light and dark modes using stored preferences.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes, including typography and color tokens.",
  "frontend/src/layouts/AppLayout.tsx": "Provides the main app layout with top navigation, routed content area, and footer.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders a public About page with the organization's story, mission, vision, and values.",
  "frontend/src/pages/AdminAboutPage.tsx": "Provides an admin interface for editing About sections, supporting media, reordering, adding, and saving content.",
  "frontend/src/pages/AdminAndroidApkPage.tsx": "Provides an admin page to view and update the Android APK download URL with validation and status messages.",
  "frontend/src/pages/AdminBrandingPage.tsx": "Admin interface to load, edit, and save organization branding such as logo and name, with success and error handling.",
  "frontend/src/pages/AdminClubsManagerPage.tsx": "Provides CRUD management for clubs, including creating, editing, and deleting club entries with form handling and dialogs.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Displays admin dashboard with navigation links to various management tools like branding, home page, and about editor.",
  "frontend/src/pages/AdminEventsManagerPage.tsx": "Allows admins to create, edit, and delete events with form validation, success/error messages, and confirmation dialogs.",
  "frontend/src/pages/AdminHistoryEditorPage.tsx": "Page for editing the history content and associated media with save functionality and loading state support.",
  "frontend/src/pages/AdminHomePageEditorPage.tsx": "Admin interface for editing homepage sections, allowing CRUD of section titles, descriptions, and images with save functionality.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login form handling authentication and redirecting authenticated users to the dashboard.",
  "frontend/src/pages/AdminMembershipReviewPage.tsx": "Displays and reviews membership registrations, showing details for each submission with loading and error states.",
  "frontend/src/pages/AdminSocialLinksPage.tsx": "Admin form for viewing and updating social media link URLs with success and error handling.",
  "frontend/src/pages/ClubDetailPage.tsx": "Fetches and displays detailed information for a specific club, including loading, error, and not‑found states.",
  "frontend/src/pages/ClubsPage.tsx": "Displays a list of clubs with loading, error, and empty states, and links to individual club pages.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact methods including email, phone, location, and office hours using card components.",
  "frontend/src/pages/EventsPage.tsx": "Fetches and displays upcoming events with parsed dates, handling loading, error, and empty states.",
  "frontend/src/pages/HistoryPage.tsx": "Loads and displays organizational history content with optional media and fallback messaging.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page hero, dynamic sections, and links using fetched content or defaults.",
  "frontend/src/pages/MembershipRegistrationPage.tsx": "Provides a membership registration form with submission handling and a success confirmation view.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the Privacy Policy page with scrollable sections outlining data usage and privacy practices.",
  "frontend/src/pages/ProgramsPage.tsx": "Displays a grid of youth programs with icons, descriptions, age ranges, schedules, and a join call‑to‑action.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Renders the Terms of Service page with scrollable sections describing site usage rules and membership requirements.",
  "frontend/src/utils/adsense.ts": "Injects the Google AdSense script once using a client ID from environment variables.",
  "frontend/src/utils/media.ts": "Provides media validation, file reading, preview URL helpers, and type checks for images and videos.",
  "frontend/src/utils/seo.ts": "Updates canonical and Open Graph URL meta tags for SEO based on the current route.",
  "frontend/src/utils/share.ts": "Implements URL sharing via Web Share API with clipboard fallback and structured result reporting.",
  "frontend/src/utils/theme.ts": "Manages light/dark theme storage and application using localStorage and DOM class toggling.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters with sessionStorage and hash/query support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom fonts, OKLCH color tokens, container settings, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, architecture notes, known issues, generated assets, and existing features for ongoing UI, admin, and deployment work."
}