{
  "backend/main.mo": "Motoko canister defining types and CRUD-like admin/user actions for history, memberships, clubs, and content with access control enforcement.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and tests with metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each main frontend component, page, and utility.",
  "frontend/docs/android-apk-from-pwa.md": "Documentation explaining how to generate an Android APK from the deployed PWA using TWA and Bubblewrap.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Root HTML file containing SEO metadata, PWA tags, manifest link, and root mount point.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, display mode, colors, and metadata.",
  "frontend/public/robots.txt": "Robots rules allowing crawling, blocking admin pages, and pointing to sitemap.xml.",
  "frontend/public/sitemap.xml": "Static sitemap listing public site routes with frequencies and priorities.",
  "frontend/public/sw.js": "Service worker implementing install, activate, and network-first fetch caching for PWA support.",
  "frontend/src/App.tsx": "Configures the application's routing tree using TanStack Router and links each path to its corresponding page component.",
  "frontend/src/components/AdminGuard.tsx": "Protects admin-only pages by checking admin session state and redirecting unauthorized users to the login page.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with quick links and dynamically loaded social media icons based on fetched link data.",
  "frontend/src/components/InstallPromptBanner.tsx": "Displays a PWA install banner when installable, offering install and dismiss actions.",
  "frontend/src/components/TopNav.tsx": "Provides the responsive top navigation bar with links, mobile menu, and admin-aware 'Me' link.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin login state with persisted session storage and simple credential validation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Provides a hook to detect PWA installability, trigger the install prompt, track installation state, and dismiss prompts.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating history content, membership registrations, clubs, and other backend data via an actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark modes with a warm color palette.",
  "frontend/src/layouts/AppLayout.tsx": "Defines the main application layout with a top nav, routed content area, and footer.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders a static About page describing the organization’s story, mission, vision, and values.",
  "frontend/src/pages/AdminAboutPage.tsx": "Provides an admin interface for editing and managing About page sections with add, remove, and save functionality.",
  "frontend/src/pages/AdminClubsManagerPage.tsx": "Implements an admin UI to create, edit, and delete clubs, including form handling and confirmation dialogs.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard UI with navigation cards for editing home, about, history, and other site content, plus logout handling.",
  "frontend/src/pages/AdminHistoryEditorPage.tsx": "Provides a text editor to view and update the organization's history content using API hooks with save feedback.",
  "frontend/src/pages/AdminHomePageEditorPage.tsx": "Allows admins to edit home page sections, modify titles/descriptions/images, add/remove sections, and save updates via API.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login form handling authentication, error states, loading state, and redirecting authenticated users to the dashboard.",
  "frontend/src/pages/AdminMembershipReviewPage.tsx": "Fetches and displays membership registrations with details, handling loading, error, and empty states.",
  "frontend/src/pages/AdminSocialLinksPage.tsx": "Admin page that loads existing social media links, lets admins edit them via a form, and saves updates with success and error feedback.",
  "frontend/src/pages/ClubDetailPage.tsx": "Displays detailed information for a single club, handling loading, error, and not‑found states with a styled layout.",
  "frontend/src/pages/ClubsPage.tsx": "Fetches and lists all clubs in a grid with loading and error handling, each linking to a dedicated club detail page.",
  "frontend/src/pages/ContactPage.tsx": "Static contact page showing email, phone, address, and office hours using cards and icons.",
  "frontend/src/pages/EventsPage.tsx": "Renders a list of predefined upcoming events with details and category badges.",
  "frontend/src/pages/HistoryPage.tsx": "Shows organization history content fetched from the backend with loading and error states.",
  "frontend/src/pages/HomePage.tsx": "Home page component that loads about and homepage sections, renders hero content, default program highlights, and an install prompt banner.",
  "frontend/src/pages/MembershipRegistrationPage.tsx": "Membership registration form with submission handling, success state display, and admin login link.",
  "frontend/src/pages/ProgramsPage.tsx": "Displays a grid of predefined youth programs with icons, descriptions, ages, schedules, and a call‑to‑action section.",
  "frontend/src/utils/seo.ts": "Utility functions to update canonical and Open Graph URL meta tags based on the current route.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration customizing colors, fonts, radii, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Contains project metadata describing current scope, architecture, features, known issues, and required/generated images. It tracks frontend/backend structure, admin workflows, and overall project state versioning."
}