{
  "backend/main.mo": "Motoko canister providing admin‑gated CRUD for events, APK URL management, user profile access, and storage-backed content sections with access control mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON structure.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of major frontend components, pages, hooks, and config files.",
  "frontend/docs/adsense.md": "Guide explaining how to enable Google AdSense via environment variable and client ID.",
  "frontend/docs/android-apk-from-pwa.md": "Guide describing how to generate an Android APK from the PWA using Bubblewrap and TWA.",
  "frontend/docs/production-deploy-google-search-console.md": "Instructions for production deployment and Google Search Console verification for Version 19.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, light/dark themes, and global element styling.",
  "frontend/index.html": "Main HTML template with SEO tags, PWA metadata, and root mount for the frontend app.",
  "frontend/public/ads.txt": "Placeholder ads.txt file instructing developers to add their official AdSense entry.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, categories, and display settings.",
  "frontend/public/robots.txt": "Robots rules allowing crawlers, blocking /me/ admin routes, and referencing sitemap.xml.",
  "frontend/public/sitemap.xml": "Static sitemap listing public site routes with priorities and change frequencies.",
  "frontend/public/sw.js": "Service worker v19 implementing network-first caching, static asset precaching, and offline fallback.",
  "frontend/scripts/run-prod-build-with-gsc-check.ts": "Node script running the production build and verifying the Google Search Console meta tag before deployment.",
  "frontend/scripts/verify-gsc-meta.ts": "Build-time script that checks dist/index.html for the exact Google Search Console verification meta tag and exits with errors if missing.",
  "frontend/src/App.tsx": "Defines the application's routing structure using TanStack Router, mapping all public and admin pages to their respective paths.",
  "frontend/src/components/admin/MediaPicker.tsx": "File picker for images and videos with validation, upload progress tracking, previews, and remove support.",
  "frontend/src/components/AdminGuard.tsx": "Component that blocks access to admin-only pages by redirecting non-admin users to the login route and showing an access denied message.",
  "frontend/src/components/Footer.tsx": "Footer component displaying organization info, quick links, dynamic social links, and a share button with clipboard fallback.",
  "frontend/src/components/HomeBottomNavMenu.tsx": "Mobile-only bottom sheet menu that provides navigation links and a dynamic 'Me' link based on session state.",
  "frontend/src/components/InstallPromptBanner.tsx": "Banner prompting users to install the PWA, offering install and dismiss actions when the app is installable.",
  "frontend/src/components/SettingsSheet.tsx": "Slide-out settings panel offering theme toggle, share link, PWA install, and APK download options.",
  "frontend/src/components/TopNav.tsx": "Responsive top navigation bar with branding, navigation links, mobile menu, account actions, sharing, and logout handling.",
  "frontend/src/config/branding.ts": "Provides default logo path and a helper to resolve branding logo URLs.",
  "frontend/src/config/navLinks.ts": "Defines primary navigation links and returns the correct 'Me' link depending on admin status.",
  "frontend/src/config/publicSite.ts": "Exports the constant public site URL used across the app.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAdminSession.ts": "Zustand store for admin login state with credential validation and session persistence in sessionStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Handles PWA install prompt logic, tracking installability, dismissal, and triggering installation.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend calls for branding, history, membership, clubs, and events with cache management.",
  "frontend/src/hooks/useTheme.ts": "Theme hook that loads, applies, and toggles between light and dark UI themes.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light/dark themes and typography styles.",
  "frontend/src/layouts/AppLayout.tsx": "Provides the main page layout with top navigation, footer, and routed content area.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the public About page with organization story, mission, vision, and values.",
  "frontend/src/pages/AdminAboutPage.tsx": "Admin interface for managing About sections with editing, media support, and save functionality.",
  "frontend/src/pages/AdminAndroidApkPage.tsx": "Admin page to configure and validate the downloadable Android APK URL.",
  "frontend/src/pages/AdminBrandingPage.tsx": "Admin page for updating branding assets like the organization logo with upload and save features.",
  "frontend/src/pages/AdminClubsManagerPage.tsx": "Provides a UI for admins to create, edit, and delete clubs using form fields, query hooks, and confirmation dialogs.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Displays the admin dashboard with navigation cards linking to different content editors and a logout option.",
  "frontend/src/pages/AdminEventsManagerPage.tsx": "Allows admins to create, edit, and delete events with validation, form handling, and mutation hooks.",
  "frontend/src/pages/AdminHistoryEditorPage.tsx": "Enables editing of the organization’s history text and media with autosave feedback and data loading.",
  "frontend/src/pages/AdminHomePageEditorPage.tsx": "Lets admins manage home page sections, including titles, descriptions, images, and adding or removing sections.",
  "frontend/src/pages/AdminLoginPage.tsx": "Renders an admin login form with username and password, handling authentication, loading states, and error messages. Redirects authenticated admins to the dashboard.",
  "frontend/src/pages/AdminMembershipReviewPage.tsx": "Displays and manages a list of membership registration submissions with loading, error, and empty states. Provides detailed cards for each registration and navigation back to the dashboard.",
  "frontend/src/pages/AdminSocialLinksPage.tsx": "Provides a form for viewing and updating social media link URLs, including loading, success, and error handling. Fetches existing links and saves updates through API hooks.",
  "frontend/src/pages/ClubDetailPage.tsx": "Shows detailed information for a single club by ID with loading, error, and not‑found handling. Displays club profile, slogan, aims, and other sections using card components.",
  "frontend/src/pages/ClubsPage.tsx": "Lists all clubs with loading, error, and empty states, displaying each club in a card with basic info and a link to its detail page. Includes a call‑to‑action section for membership registration.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page with cards for email, phone, address, and office hours.",
  "frontend/src/pages/EventsPage.tsx": "Fetches and displays upcoming events with loading, error, and empty states.",
  "frontend/src/pages/HistoryPage.tsx": "Loads and displays organizational history content with optional media and fallback states.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with hero content, dynamic sections, and data-driven highlights.",
  "frontend/src/pages/MembershipRegistrationPage.tsx": "Provides a membership registration form with submission handling and a success message.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Shows a scrollable privacy policy outlining data collection, use, and security practices.",
  "frontend/src/pages/ProgramsPage.tsx": "Renders a grid of youth programs with icons, descriptions, ages, schedules, and a call-to-action section.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Displays the Terms of Service in a scrollable card with structured sections and headings.",
  "frontend/src/utils/adsense.ts": "Injects the Google AdSense script once using a client ID from environment variables.",
  "frontend/src/utils/media.ts": "Provides media validation, file conversion to Uint8Array, preview URL helpers, and file-type checks.",
  "frontend/src/utils/seo.ts": "Updates canonical and Open Graph URL meta tags based on the current route path.",
  "frontend/src/utils/share.ts": "Shares URLs using the Web Share API with clipboard fallback and detailed success/error handling.",
  "frontend/src/utils/theme.ts": "Manages light/dark theme persistence, storage, and DOM application.",
  "frontend/src/utils/urlParams.ts": "Reads, stores, and persists URL parameters with sessionStorage support and hash-query handling.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, radii, animations, and plugin setup.",
  "project_state.json": "Contains the project's current state, including scope, architecture notes, known issues, generated assets, and a list of existing features with metadata."
}