{
  "backend/main.mo": "Motoko canister providing access control, user profiles, history content with media, membership registrations, club data, social links, about/home sections, and branding storage.",
  "feature_evidence.json": "Feature evidence report listing deployment and verification features with related files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to brief descriptions of their UI, routing, admin tools, and data-fetching roles.",
  "frontend/docs/adsense.md": "Guide explaining how to enable Google AdSense via the VITE_ADSENSE_CLIENT_ID environment variable.",
  "frontend/docs/android-apk-from-pwa.md": "Instructions for generating an Android APK from the PWA using Bubblewrap and TWA.",
  "frontend/docs/production-deploy-google-search-console.md": "Deployment guide for Version 19 including Google Search Console verification requirements and build checks.",
  "frontend/index.css": "Global Tailwind-based OKLCH color and theme variables with light/dark mode definitions.",
  "frontend/index.html": "Base HTML template including SEO metadata, GSC verification tag, PWA setup, and main script entry.",
  "frontend/public/ads.txt": "Placeholder ads.txt file instructing users to insert their Google AdSense publisher configuration.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining name, icons, colors, categories, and startup behavior.",
  "frontend/public/robots.txt": "Crawler rules allowing indexing but blocking admin paths and linking to sitemap.",
  "frontend/public/sitemap.xml": "XML sitemap listing key public routes with change frequency and priority metadata.",
  "frontend/public/sw.js": "Service worker implementing cache version 19 with network-first strategy and static asset caching.",
  "frontend/scripts/run-prod-build-with-gsc-check.ts": "Runs the production build, checks for the dist folder, and executes the Google Search Console meta verification script.",
  "frontend/scripts/verify-gsc-meta.ts": "Validates that the built index.html contains the required Google Search Console meta tag and exits on failure.",
  "frontend/src/App.tsx": "Defines the main React router configuration, setting up routes for public pages and admin sections.",
  "frontend/src/components/admin/MediaPicker.tsx": "UI component for selecting, validating, uploading, previewing, and removing image or video files using ExternalBlob.",
  "frontend/src/components/AdminGuard.tsx": "Restricts access to admin-only pages and redirects unauthorized users to the admin login page.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with social links, quick navigation, and a share button with clipboard fallback.",
  "frontend/src/components/HomeBottomNavMenu.tsx": "Provides a mobile bottom-sheet navigation menu linked to primary routes and the user’s admin link.",
  "frontend/src/components/InstallPromptBanner.tsx": "Displays a PWA installation banner when installable, allowing users to install or dismiss.",
  "frontend/src/components/SettingsSheet.tsx": "Shows a settings panel with theme toggling, share link functionality, and optional PWA install action.",
  "frontend/src/components/TopNav.tsx": "Top navigation bar with branding logo, desktop and mobile menus, share handling, and logout logic for admin and Internet Identity users.",
  "frontend/src/config/branding.ts": "Provides default logo path and helper to resolve branding logo URL with fallback.",
  "frontend/src/config/navLinks.ts": "Defines primary navigation links and a helper that returns the appropriate '/me' route based on admin status.",
  "frontend/src/config/publicSite.ts": "Exports the public production site URL constant used across the app.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, reinitializing and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAdminSession.ts": "Zustand store that manages simple admin login/logout with hardcoded credentials persisted in sessionStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login state, persistence, and AuthClient configuration.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Hook that detects PWA installability, tracks dismissal and installation state, and triggers the install prompt.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data such as branding, history, membership, and clubs.",
  "frontend/src/hooks/useTheme.ts": "Hook for reading, applying, and toggling between light and dark themes with persistence.",
  "frontend/src/index.css": "Configures Tailwind base layers and defines extensive light/dark theme CSS variables and typography styles.",
  "frontend/src/layouts/AppLayout.tsx": "Provides the main layout with top navigation, footer, and routed content area.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers and loading global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the public About page with organizational story, mission, vision, and values content.",
  "frontend/src/pages/AdminAboutPage.tsx": "Admin interface for viewing and editing About page sections, including text, links, and media.",
  "frontend/src/pages/AdminBrandingPage.tsx": "Admin interface for updating organization branding, primarily the logo and related media.",
  "frontend/src/pages/AdminClubsManagerPage.tsx": "Admin tool for creating, editing, and deleting clubs with full club detail forms and confirmation dialogs.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with logout and navigation cards for branding, home page, about, and other admin tools. Uses AdminGuard and admin session hooks for access control.",
  "frontend/src/pages/AdminHistoryEditorPage.tsx": "Provides an editor for updating history text and media, loading existing data and saving updates via mutations. Includes back navigation and status indicators for loading and saving.",
  "frontend/src/pages/AdminHomePageEditorPage.tsx": "Allows admins to edit home page sections with text and optional media, add or remove sections, and save changes through an update mutation. Displays success and error alerts with loading states.",
  "frontend/src/pages/AdminLoginPage.tsx": "Implements an admin login form with username and password fields, session-based authentication, error handling, and redirect on success.",
  "frontend/src/pages/AdminMembershipReviewPage.tsx": "Displays a list of membership registrations with details and loading/error states, allowing admins to review submissions from the dashboard.",
  "frontend/src/pages/AdminSocialLinksPage.tsx": "Admin page for viewing and updating social media link URLs with form handling, loading states, success/error alerts, and data fetched via hooks.",
  "frontend/src/pages/ClubDetailPage.tsx": "Displays detailed information for a single club with loading, error, and not-found handling using a club ID from route params.",
  "frontend/src/pages/ClubsPage.tsx": "Lists all clubs in a responsive grid with loading, error, and empty states, each linking to a detailed club page.",
  "frontend/src/pages/ContactPage.tsx": "Static contact page showing email, phone, address, and office hours using styled cards.",
  "frontend/src/pages/EventsPage.tsx": "Renders a list of predefined upcoming events with details and type badges in styled cards.",
  "frontend/src/pages/HistoryPage.tsx": "Fetches and displays organizational history content with media support and fallback states for loading, errors, or missing content.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with hero content, dynamic sections from backend, default fallback sections, and navigation elements.",
  "frontend/src/pages/MembershipRegistrationPage.tsx": "Displays a membership registration form with submission handling and a confirmation state.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Shows a scrollable privacy policy document inside a styled card layout.",
  "frontend/src/pages/ProgramsPage.tsx": "Lists predefined youth programs with icons, descriptions, age ranges, and schedules.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Displays a scrollable terms of service document with multiple policy sections.",
  "frontend/src/utils/adsense.ts": "Injects the Google AdSense script into the document head once using a configured client ID.",
  "frontend/src/utils/media.ts": "Provides media file validation, file-to-Uint8Array conversion, preview URL helpers, and type checks.",
  "frontend/src/utils/seo.ts": "Updates canonical and Open Graph URL meta tags for SEO based on the current route path.",
  "frontend/src/utils/share.ts": "Provides a URL sharing helper using the Web Share API with a clipboard fallback and standardized success/error results.",
  "frontend/src/utils/theme.ts": "Handles storing, applying, and initializing light/dark themes using localStorage and root element classes.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning hash params for routing and state handling.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, typography, container queries, animations, and extended theme settings.",
  "project_state.json": "Captures the project's current scope, architecture notes, issues, and feature inventory for planning and tracking."
}