{
  "backend/main.mo": "Motoko canister providing access-controlled CRUD for events, media-backed content sections, clubs, branding, social links, and APK URL handling.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests related to GSC-verified production build flow.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend source files for reference or documentation.",
  "frontend/docs/adsense.md": "Guide explaining how to enable and configure Google AdSense using an environment variable.",
  "frontend/docs/android-apk-from-pwa.md": "Documentation on generating an Android APK from the PWA using Bubblewrap and TWA.",
  "frontend/docs/production-deploy-google-search-console.md": "Deployment guide detailing production workflow and Google Search Console verification requirements.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables and light/dark mode tokens.",
  "frontend/index.html": "Main HTML entry including SEO metadata, PWA tags, and Google Search Console verification meta tag.",
  "frontend/public/ads.txt": "Placeholder ads.txt file instructing users to insert their AdSense publisher ID.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, and display behavior.",
  "frontend/public/robots.txt": "Robots.txt allowing crawlers but disallowing /me/ paths and specifying sitemap location.",
  "frontend/public/sitemap.xml": "Sitemap listing all public site routes with change frequency and priority.",
  "frontend/public/sw.js": "Version 19 service worker implementing network-first caching and static asset pre-caching.",
  "frontend/scripts/run-prod-build-with-gsc-check.ts": "Runs the production frontend build, logs output, checks for the dist directory, and verifies the Google Search Console meta tag before deployment.",
  "frontend/scripts/verify-gsc-meta.ts": "Validates that the built dist/index.html contains the exact required Google Search Console verification meta tag, exiting with errors if missing.",
  "frontend/src/App.tsx": "Defines the main React router structure, mapping all public and admin routes to their respective page components.",
  "frontend/src/components/admin/MediaPicker.tsx": "Media picker allowing image/video selection, validation, preview, and upload progress handling.",
  "frontend/src/components/AdminGuard.tsx": "Protects admin routes by redirecting non-admin users to the login page and showing an access denied message.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with dynamic social media links, quick navigation links, and a share button with clipboard feedback.",
  "frontend/src/components/HomeBottomNavMenu.tsx": "Provides a mobile bottom navigation menu using a sheet UI, allowing quick navigation based on current route state.",
  "frontend/src/components/InstallPromptBanner.tsx": "Shows a PWA install prompt banner when installable, allowing users to install the app or dismiss the prompt.",
  "frontend/src/components/SettingsSheet.tsx": "A settings panel that manages theme switching, sharing the site URL, PWA install, and APK downloads.",
  "frontend/src/components/TopNav.tsx": "Top navigation bar with branding, navigation links, mobile menu, sharing, user session handling, and settings access.",
  "frontend/src/config/branding.ts": "Provides default logo path and a helper to derive the logo URL from branding data.",
  "frontend/src/config/navLinks.ts": "Defines primary navigation links and a utility to determine the user-specific 'Me' link based on admin status.",
  "frontend/src/config/publicSite.ts": "Exports the shared public site URL constant.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useAdminSession.ts": "Zustand store for admin login/logout with persisted session storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication, exposing identity state and login/clear actions.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Hook for handling PWA install prompts, tracking installability, dismissal, and installation state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and updating branding, history content, membership registrations, and clubs via an actor API.",
  "frontend/src/hooks/useTheme.ts": "Provides a theme state hook with light/dark toggling and persistence.",
  "frontend/src/index.css": "Sets up Tailwind layers and CSS variables for light and dark themes along with base typography and layout styles.",
  "frontend/src/layouts/AppLayout.tsx": "Defines the root layout with top navigation, routed content, and footer.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity providers and imports global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders a public About page with organization story, mission, vision, and values sections.",
  "frontend/src/pages/AdminAboutPage.tsx": "Admin interface for viewing, editing, adding, and removing About sections with media support.",
  "frontend/src/pages/AdminAndroidApkPage.tsx": "Admin page to view and update the Android APK download URL with validation and status messages.",
  "frontend/src/pages/AdminBrandingPage.tsx": "Provides an admin interface to load, edit, and save branding media such as the organization logo with success and error handling.",
  "frontend/src/pages/AdminClubsManagerPage.tsx": "Implements CRUD management for clubs, including forms for creating and editing club details and a confirmation dialog for deletions.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Displays the main admin dashboard with navigation links to branding, home, about, and other management tools, plus a logout button.",
  "frontend/src/pages/AdminEventsManagerPage.tsx": "Allows admins to create, edit, and delete events with form validation, success/error messaging, and date-time handling.",
  "frontend/src/pages/AdminHistoryEditorPage.tsx": "Loads and edits the organization's history text and media, providing save functionality with loading and success indicators.",
  "frontend/src/pages/AdminHomePageEditorPage.tsx": "Provides an admin interface to view, edit, add, and remove home page sections, saving updates via API mutations.",
  "frontend/src/pages/AdminLoginPage.tsx": "Renders the admin login form, handling authentication, navigation, and error states.",
  "frontend/src/pages/AdminMembershipReviewPage.tsx": "Displays a list of membership registrations for admins with loading, error, and empty states.",
  "frontend/src/pages/AdminSocialLinksPage.tsx": "Allows admins to view and update social media link URLs with save feedback and validation states.",
  "frontend/src/pages/ClubDetailPage.tsx": "Fetches and displays details for a specific club with loading, error, and not-found handling.",
  "frontend/src/pages/ClubsPage.tsx": "Displays a list of clubs with loading, error, and empty states and links to individual club pages.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact methods including email, phone, address, and office hours using styled cards.",
  "frontend/src/pages/EventsPage.tsx": "Fetches and lists upcoming events with formatted date/time and handles loading, error, and empty states.",
  "frontend/src/pages/HistoryPage.tsx": "Loads and displays organizational history content with optional media and fallback states.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content, dynamic sections from backend, and navigation actions.",
  "frontend/src/pages/MembershipRegistrationPage.tsx": "Provides a membership registration form with submission handling, success state, and admin login link.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the Privacy Policy page with scrollable sections detailing data collection, usage, and disclosure.",
  "frontend/src/pages/ProgramsPage.tsx": "Displays a grid of youth programs with icons, descriptions, ages, schedules, and a call‑to‑action section.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Renders the Terms of Service page with scrollable sections outlining terms, licenses, conduct, and membership rules.",
  "frontend/src/utils/adsense.ts": "Injects the Google AdSense script into the document head once using a Vite environment client ID.",
  "frontend/src/utils/media.ts": "Provides media file validation, conversion to Uint8Array, preview URL helpers, and type-checking utilities.",
  "frontend/src/utils/seo.ts": "Updates canonical and Open Graph URL meta tags based on the current route path.",
  "frontend/src/utils/share.ts": "Shares a URL using the Web Share API with clipboard and textarea fallbacks when unsupported.",
  "frontend/src/utils/theme.ts": "Manages storing, applying, and initializing light/dark theme selection using localStorage.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters with sessionStorage support and hash-based routing handling.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color system via CSS variables, extended typography, animations, and plugins.",
  "project_state.json": "Project metadata describing frontend/backend architecture, requested UI changes, known issues, and existing features for planning and fixes."
}