{
  "kind": "build_request",
  "title": "Move main navigation to a bottom menu on Home, repurpose hamburger menu, add Settings with theme toggle and shareable link",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-40",
      "text": "Move the primary navigation menu (Home/About/Programs/Events/Clubs/History/Membership/Contact/Me) out of the mobile hamburger (three-lines) menu and make it accessible from the Home page via a bottom-positioned button that opens the main menu.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Bring the main Manu from that three lines to the home page  Let it appear at the down button of the main interface"
        ]
      },
      "acceptanceCriteria": [
        "On mobile, the TopNav hamburger menu no longer contains the full site navigation links.",
        "On the Home page, a bottom-positioned button is visible that opens a menu/sheet containing the primary navigation links.",
        "Selecting any navigation item from the Home bottom menu navigates to the selected route and closes the menu.",
        "The Home bottom menu is keyboard accessible (can be opened via keyboard and items can be focused/activated)."
      ]
    },
    {
      "id": "REQ-41",
      "text": "Change the mobile hamburger (three-lines) menu contents to include only: Settings, Close, and Logout (using English user-facing text).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "the three lines should rather consist of settings, close, logout"
        ]
      },
      "acceptanceCriteria": [
        "Opening the hamburger menu shows only three actions labeled “Settings”, “Close”, and “Logout”.",
        "“Close” closes the hamburger menu without navigating.",
        "“Settings” opens a Settings UI (sheet/modal/page) and closes the hamburger menu.",
        "“Logout” logs the user out of the current session (Internet Identity logout if logged in; and clears admin session if active), then returns the user to a public route (e.g., Home)."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Add a Settings UI that includes a theme toggle button to switch between Light and Dark mode, persisting the selected theme across page reloads.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The settings should have a button to change the theme from dark to light or vice versa."
        ]
      },
      "acceptanceCriteria": [
        "Settings includes a clear theme control labeled in English (e.g., “Theme: Light / Dark” or “Switch to Dark Mode”).",
        "Toggling the theme updates the UI immediately by switching Tailwind theme styles (using the existing `.dark` theme variables in `frontend/src/index.css`).",
        "The selected theme persists across reloads (e.g., stored in localStorage) and is applied on initial load.",
        "The theme toggle works on all pages (not just Home)."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Provide a shareable public access link in the UI that users can copy and send to colleagues; use the production URL https://pd5nf-fqaaa-aaaan-qetaq-cai.icp0.io as the default share link text shown to the user.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "if you can generate a link for me so that I send to my other colleagues for them to also go through it"
        ]
      },
      "acceptanceCriteria": [
        "Settings displays the share link `https://pd5nf-fqaaa-aaaan-qetaq-cai.icp0.io` and a “Copy link” action.",
        "Clicking “Copy link” copies the link to the clipboard and shows a visible success confirmation (toast/inline message).",
        "The share link UI uses English user-facing text."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Improve add-to-home-screen discoverability by adding an “Install app” entry point inside Settings that triggers the existing PWA install flow when available, and otherwise shows a short English message guiding the user to use the browser’s “Add to Home screen” option.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make it one I can add to home screen for easy access although Google hasn't verified it"
        ]
      },
      "acceptanceCriteria": [
        "Settings contains an “Install app” section/action.",
        "If installation is supported (install prompt available), the Settings “Install app” action triggers the same install prompt behavior used by `InstallPromptBanner`.",
        "If installation is not supported, Settings shows an English hint explaining how to add to home screen via the browser menu.",
        "No backend changes are required for this feature."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Update the existing Android APK documentation to clearly explain how to produce an APK from the deployed PWA URL and explicitly clarify what is and is not supported regarding Google Play distribution (e.g., signing, Play Console submission steps are outside the app build system).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make it a full apk to support Google Play service and other android version on any android phone"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/docs/android-apk-from-pwa.md` includes a section that references the production PWA URL `https://pd5nf-fqaaa-aaaan-qetaq-cai.icp0.io` as an example input for Bubblewrap.",
        "The doc includes a short, clear note (English) explaining that creating the APK is supported via TWA/Bubblewrap, but publishing to Google Play requires separate developer account steps and is not performed automatically by the app.",
        "Documentation remains consistent with the current Vite + PWA setup (manifest + service worker) and does not introduce unsupported backend services."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (shadcn/ui sources are read-only).",
    "Do not edit any paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT; compose new hooks/components instead.",
    "Keep all backend logic in the existing single Motoko actor (`backend/main.mo`); no backend changes are required for this request."
  ],
  "nonGoals": [
    "Submitting the app to Google Play on the user’s behalf.",
    "Adding native Android-specific features beyond the existing PWA + TWA (Trusted Web Activity) wrapper approach.",
    "Changing the existing site content models (clubs/about/home/history) or backend APIs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}