{
  "kind": "build_request",
  "title": "Deploy latest production build with Google Search Console verification meta tag",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-46",
      "text": "Deploy the latest application build (current latest version) to the production Internet Computer canisters so the public site is served at https://pd5nf-fqaaa-aaaan-qetaq-cai.icp0.io.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can you deploy the site with the latest version with the meta tag so that when I click on it to go life then I do the verification"
        ]
      },
      "acceptanceCriteria": [
        "Visiting https://pd5nf-fqaaa-aaaan-qetaq-cai.icp0.io loads the latest frontend UI (not an older cached bundle).",
        "The backend canister deployed corresponds to the same latest release intended for production."
      ]
    },
    {
      "id": "REQ-47",
      "text": "Ensure the deployed production HTML contains the Google Search Console verification meta tag in the rendered <head> on https://pd5nf-fqaaa-aaaan-qetaq-cai.icp0-io, and fail the build/deploy process if the meta tag is missing (using the existing build-time verification script).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "deploy the site with the latest version with the meta tag"
        ]
      },
      "acceptanceCriteria": [
        "The deployed site’s page source for https://pd5nf-fqaaa-aaaan-qetaq-cai.icp0.io includes the google-site-verification meta tag inside the <head>.",
        "The existing check script (frontend/scripts/verify-gsc-meta.ts) runs as part of the production build/deploy pipeline and causes a non-zero exit if the meta tag is missing.",
        "After deployment, Google Search Console can reach the site (no “site not found” due to the site not being live)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything under frontend/src/components/ui.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding or changing any new SEO features beyond ensuring the existing verification meta tag is present on the live production site.",
    "Changing the Google Search Console verification token value (only ensure it is present and deployed).",
    "Implementing new app features unrelated to production deployment and verification."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}