{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Share link reliability, Android APK settings pathway, and admin-managed Events UI",
  "requirements": [
    {
      "id": "REQ-61",
      "summary": "Fix and verify Share link actions across TopNav mobile menu, Settings, and Footer using Web Share API with robust clipboard fallback and English feedback.",
      "acceptanceCriteria": [
        "On https://pd5nf-fqaaa-aaaan-qetaq-cai.icp0.io, the mobile hamburger menu contains a working \"Share link\" action that triggers native sharing when supported and otherwise copies the production URL to clipboard.",
        "On https://pd5nf-fqaaa-aaaan-qetaq-cai.icp0.io, the Settings panel \"Share link\" control works the same way (native share when available, clipboard fallback).",
        "On https://pd5nf-fqaaa-aaaan-qetaq-cai.icp0.io, the Footer share control works the same way (native share when available, clipboard fallback).",
        "User-facing feedback is in English (e.g., \"Link copied to clipboard\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/share.ts",
          "operation": "modify",
          "description": "Harden shareUrl behavior for production by keeping Web Share API support and improving clipboard fallback reliability (e.g., handle environments without navigator.clipboard via a safe in-browser copy fallback), while ensuring all returned messages remain English and consistent (\"Link copied to clipboard\", etc.)."
        },
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "modify",
          "description": "Verify the mobile hamburger menu \"Share link\" action is present, uses PUBLIC_SITE_URL, and surfaces English feedback when clipboard fallback is used; align labels/casing with other entry points."
        },
        {
          "path": "frontend/src/components/SettingsSheet.tsx",
          "operation": "modify",
          "description": "Verify the Settings \"Share link\" control uses shareUrl(PUBLIC_SITE_URL, ...) and shows English feedback when clipboard fallback is used; keep wording clearly about sharing the link (not installation)."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Verify the Footer share control uses shareUrl(PUBLIC_SITE_URL, ...) and shows English feedback when clipboard fallback is used."
        }
      ]
    },
    {
      "id": "REQ-62",
      "summary": "Separate Share vs Install UX and add a Settings-based Android APK download action backed by an admin-configurable APK URL.",
      "acceptanceCriteria": [
        "The UI clearly separates sharing from installation using English user-facing text (e.g., \"Share link\" vs \"Install\"), without placing install-related actions under Share.",
        "Backend exposes a publicly readable Android APK download URL (e.g., getAndroidApkUrl) and an admin-only update method (e.g., setAndroidApkUrl).",
        "Settings UI displays an \"Android APK\" section with a \"Download Android APK\" button when the APK URL is set; clicking it opens the configured URL.",
        "If the APK URL is not set, Settings shows an English message such as \"Android APK is not available yet. Please check back later.\" (or equivalent).",
        "The existing PWA install flow remains available (do not remove PWA install)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for Android APK configuration: a query hook to read the current APK URL (calling the existing backend actor capability) and a mutation hook to update it (admin usage), following existing hook patterns and graceful disabling when the actor is unavailable."
        },
        {
          "path": "frontend/src/components/SettingsSheet.tsx",
          "operation": "modify",
          "description": "Update Settings UX copy to clearly separate \"Share link\" from installation; keep the existing PWA install flow intact and add a new \"Android APK\" section driven by the APK URL query hook, showing a \"Download Android APK\" button when set (opens configured URL) and an English not-available message when unset."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add a new admin dashboard navigation card/entry for managing the Android APK URL (English label), linking to the new admin-gated APK settings page."
        },
        {
          "path": "frontend/src/pages/AdminAndroidApkPage.tsx",
          "operation": "create",
          "description": "Create an admin-gated page for viewing/updating the configured Android APK URL using the new query/mutation hooks, with English validation and save feedback."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new admin route under the existing admin area (e.g., /me/android-apk) that renders the new AdminAndroidApkPage component."
        }
      ]
    },
    {
      "id": "REQ-64",
      "summary": "Add React Query hooks for Events read and admin mutations using existing backend actor capabilities and existing query patterns.",
      "acceptanceCriteria": [
        "A query hook exists to fetch events (e.g., useGetEvents) and returns loading/error states consistent with other hooks in frontend/src/hooks/useQueries.ts.",
        "Mutation hooks exist for create/update/delete event operations and invalidate the events query on success.",
        "Hooks are disabled gracefully when the backend actor is not available (matching existing patterns)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add Events hooks following existing patterns: a list query hook (e.g., useGetEvents) and mutation hooks for create/update (using the existing createOrUpdateEvent backend capability) and delete (deleteEvent), ensuring events queries invalidate on success and hooks are enabled only when the actor is available."
        }
      ]
    },
    {
      "id": "REQ-65",
      "summary": "Replace static Events page with backend-fetched, read-only events list including loading/error/empty states and clear event fields display.",
      "acceptanceCriteria": [
        "The public Events page no longer uses a hardcoded in-file upcomingEvents array as the source of truth.",
        "The Events page displays loading and error states consistent with other public pages (e.g., Clubs/History patterns).",
        "If there are no events, the Events page displays an English empty-state message (e.g., \"No upcoming events yet.\").",
        "For each event, the page renders title, description, date, time, location, and type in a clear layout (matching or improving the existing card layout)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/EventsPage.tsx",
          "operation": "modify",
          "description": "Remove the hardcoded upcomingEvents array and render events from the Events query hook; add loading/error/empty states consistent with other public pages, and format each event to display title/description/location plus derived date/time from dateTime; map an available backend field for \"type\" display (ensuring the UI labels are English and layout remains card-based or improved)."
        }
      ]
    },
    {
      "id": "REQ-66",
      "summary": "Create an admin-gated Events Manager page for creating, editing, and deleting events, and link it from the Admin Dashboard.",
      "acceptanceCriteria": [
        "A new admin route exists under the existing admin area (e.g., /me/events) protected by the existing AdminGuard behavior.",
        "The admin Events Manager supports: create event, edit event, delete event, with English user-facing labels and validation messages.",
        "The Admin Dashboard includes a clear navigation entry/card to reach the Events Manager page.",
        "After saving changes in the Events Manager, the public Events page reflects updates (after refresh or via normal React Query refetch behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminEventsManagerPage.tsx",
          "operation": "create",
          "description": "Create an AdminGuard-protected Events Manager page that lists current events and provides create/edit/delete flows using the Events query/mutation hooks; include English form labels, basic validation, confirmation for delete, and success/error feedback."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new admin Events Manager route under the existing admin area (e.g., /me/events) to render AdminEventsManagerPage."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add a new admin dashboard navigation card/entry for \"Events Manager\" (English label) linking to the /me/events route."
        }
      ]
    }
  ]
}