{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Consistent logo sourcing and reusable admin media picker across editors",
  "requirements": [
    {
      "id": "REQ-33",
      "summary": "Remove hardcoded logo filenames and source the header logo from a single shared branding configuration with a safe fallback.",
      "acceptanceCriteria": [
        "The TopNav logo image is not hardcoded to an unexpected filename and is sourced from a single shared configuration.",
        "The same logo is displayed on public pages and on admin pages (admin uses the same header).",
        "If no configured logo exists, the UI falls back to the existing generated logo asset without breaking layout."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks to load public branding configuration (logo) from the backend, and expose a stable queryKey for reuse. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/config/branding.ts",
          "operation": "create",
          "description": "Create a single canonical frontend branding config helper that provides the default/fallback logo asset reference and utilities to derive a displayable logo URL from optional backend branding data."
        },
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "modify",
          "description": "Replace hardcoded logo asset usage with the shared canonical logo source: prefer branding.logo (when available) and fall back to the existing generated logo asset path from the shared config; keep layout stable across desktop/mobile nav."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Add a reachable admin Branding page to update the app logo with an English-labeled image-only media button and preview-before-save UX.",
      "acceptanceCriteria": [
        "The admin area contains a reachable UI for updating the app logo.",
        "The page provides a clear button to select media from the user’s device and updates the logo preview before saving.",
        "Saving persists the selected logo so that refreshing the site still shows the updated logo.",
        "All user-facing text on the page is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminBrandingPage.tsx",
          "operation": "create",
          "description": "Create an admin-only Branding page (wrapped in AdminGuard) that loads current branding, allows selecting a new logo via the shared MediaPicker with images-only constraint, previews the logo, and saves via the branding update hook. Use the blob-storage ExternalBlob flow to produce a storable value; verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new admin route for the Branding page under the existing /me/* admin area so it is reachable."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add a new Admin Dashboard navigation card/button linking to the Branding page, with English user-facing text, without changing unrelated navigation structure."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/update mutations and queries needed for branding save/load (e.g., useGetBrandingMedia/useUpdateBrandingMedia) and ensure cache invalidation so TopNav refreshes its logo after saving. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Implement a reusable admin media picker control (Add picture or video) that supports image/video selection, preview, and clearing, returning a storable value for saving.",
      "acceptanceCriteria": [
        "A shared media-picker control exists and can be embedded in multiple admin pages without duplicating logic.",
        "The control supports choosing an image or a video file from the local device.",
        "The control provides a preview (image preview or video preview) and a way to remove/clear the selected media before saving.",
        "All user-facing text in the control is in English and consistently labeled across pages (e.g., \"Add picture or video\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/MediaPicker.tsx",
          "operation": "create",
          "description": "Create a reusable MediaPicker control for admin editors with consistent English labeling (e.g., \"Add picture or video\"), local file selection (image/video based on props), preview rendering, and remove/clear support. Use the blob-storage ExternalBlob type to produce a storable value (and a preview URL via getDirectURL when needed). Verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/media.ts",
          "operation": "create",
          "description": "Add shared helpers to validate media type/size, convert File->Uint8Array for upload, and derive preview URLs consistently for the MediaPicker and editor pages."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Add the same shared media picker to the History, About, and Home admin editors; ensure selected media saves, reloads, and is rendered on public pages.",
      "acceptanceCriteria": [
        "AdminHistoryEditorPage includes a media control and can save and reload the selected media with the history content.",
        "AdminAboutPage includes a media control for each editable section (or an equivalent per-section media attachment) and persists it through save/load.",
        "AdminHomePageEditorPage includes a media control per card/section and persists it through save/load.",
        "Public pages that render the edited content display the saved images/videos appropriately (read-only)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Align history/about/home React Query hooks and types with the current backend interface for media attachments (History returns content+media; Home sections use image?: ExternalBlob; About sections use media?: ExternalBlob). Ensure save mutations accept and send media values and invalidate relevant queries. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminHistoryEditorPage.tsx",
          "operation": "modify",
          "description": "Embed the shared MediaPicker (image/video) into the History editor, load existing history media into the control on page load, update preview immediately on selection, and include media in save behavior (clear supported). Verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HistoryPage.tsx",
          "operation": "modify",
          "description": "Render the saved History media (image/video) read-only when present (using ExternalBlob direct URL), while keeping existing loading/empty/error states intact. Verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminAboutPage.tsx",
          "operation": "modify",
          "description": "Add a per-section shared MediaPicker (image/video) to About section cards, wiring selection/clear into the section state as AboutSection.media and ensuring save/load round-trips through existing update flow. Verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "When rendering About content sections and Home page sections, display saved media (image/video) read-only where present (using ExternalBlob direct URL), while preserving existing fallbacks and layout. Verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminHomePageEditorPage.tsx",
          "operation": "modify",
          "description": "Replace the current Image URL string field with the shared MediaPicker for each card/section, storing the chosen image/video as the section media field expected by the backend interface; support preview and clear, and ensure save/load persists it. Verify the blob-storage component's usage instructions before implementing."
        }
      ]
    }
  ]
}