{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Production deploy readiness: ensure latest bundle served + enforce Google Search Console meta verification",
  "requirements": [
    {
      "id": "REQ-46",
      "summary": "Ensure the production site serves the latest frontend bundle (avoid stale/cached UI after deployment) and document the production deploy flow for the public URL.",
      "acceptanceCriteria": [
        "Visiting https://pd5nf-fqaaa-aaaan-qetaq-cai.icp0.io loads the latest frontend UI (not an older cached bundle).",
        "The backend canister deployed corresponds to the same latest release intended for production."
      ],
      "file_operations": [
        {
          "path": "frontend/public/sw.js",
          "operation": "modify",
          "description": "Adjust service worker caching behavior to reduce risk of serving stale HTML/app shell after a production deployment (e.g., avoid caching navigation/index.html responses and/or force network no-store for navigations), while keeping offline support for static assets."
        },
        {
          "path": "frontend/docs/production-deploy-google-search-console.md",
          "operation": "modify",
          "description": "Complete and update the production deployment guide to explicitly include steps that help ensure the latest build is what users see at https://pd5nf-fqaaa-aaaan-qetaq-cai.icp0.io (e.g., rebuild, redeploy, verify new bundle is served, and note service worker update considerations)."
        }
      ]
    },
    {
      "id": "REQ-47",
      "summary": "Guarantee the Google Search Console verification meta tag is present in the deployed HTML <head> and enforce a failing build when it’s missing using the existing verification script.",
      "acceptanceCriteria": [
        "The deployed site’s page source for https://pd5nf-fqaaa-aaaan-qetaq-cai.icp0.io includes the google-site-verification meta tag inside the <head>.",
        "The existing check script (frontend/scripts/verify-gsc-meta.ts) runs as part of the production build/deploy pipeline and causes a non-zero exit if the meta tag is missing.",
        "After deployment, Google Search Console can reach the site (no “site not found” due to the site not being live)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Ensure the Google Search Console verification meta tag is present in the <head> exactly as required by the existing build-time check (do not change the token value)."
        },
        {
          "path": "frontend/scripts/verify-gsc-meta.ts",
          "operation": "modify",
          "description": "Harden the existing build-time verification so it reliably fails with a non-zero exit when the required meta tag is missing in the built dist/index.html, and keep messaging aligned with production deploy usage."
        },
        {
          "path": "frontend/scripts/run-prod-build-with-gsc-check.ts",
          "operation": "create",
          "description": "Add a small production build orchestrator script that runs the frontend production build and then executes frontend/scripts/verify-gsc-meta.ts, exiting non-zero on failure, so CI/deploy can invoke a single command for enforcement."
        },
        {
          "path": "frontend/docs/production-deploy-google-search-console.md",
          "operation": "modify",
          "description": "Update the guide to require running the existing verification script (or the new wrapper script) as part of the production build/deploy process, and include a post-deploy check instruction to confirm the meta tag is present in the live page source at https://pd5nf-fqaaa-aaaan-qetaq-cai.icp0.io."
        }
      ]
    }
  ]
}