{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "SEO deployment URL readiness, PWA installability, and Android install prompt",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Make canonical/robots/sitemap reflect the deployed production URL (no placeholder domains) while keeping admin routes excluded from crawling.",
      "acceptanceCriteria": [
        "The canonical URL is not hardcoded to a placeholder domain (e.g., not fixed to https://yfo.org/) and matches the deployed site URL.",
        "frontend/public/robots.txt and frontend/public/sitemap.xml do not reference an incorrect domain for the deployed site.",
        "Admin routes remain excluded from crawling (e.g., /me/* disallowed) while public routes are crawlable.",
        "Build output still includes robots.txt and sitemap.xml at the expected public paths."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Remove the hardcoded canonical domain and adjust SEO tags to be compatible with runtime canonical URL setting (e.g., keep canonical tag present but not fixed to a placeholder, and/or allow it to be set from client code)."
        },
        {
          "path": "frontend/src/utils/seo.ts",
          "operation": "create",
          "description": "Add small SEO helpers to set/update the canonical URL to the current deployed origin + current route path (and optionally keep related share/meta URL fields consistent) at runtime."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire SEO helpers into routing so canonical updates on navigation (e.g., subscribe to TanStack Router navigation changes and update canonical accordingly)."
        },
        {
          "path": "frontend/public/robots.txt",
          "operation": "modify",
          "description": "Update robots.txt to avoid any incorrect hardcoded domain by using a non-placeholder sitemap location (e.g., a relative sitemap reference) while keeping /me/ and /me/* disallowed and public routes crawlable."
        },
        {
          "path": "frontend/public/sitemap.xml",
          "operation": "modify",
          "description": "Update sitemap.xml to remove any incorrect hardcoded domain (e.g., use non-placeholder URL forms compatible with the deployed origin) and keep only public routes listed (no /me/*)."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Add PWA support (manifest, icons, service worker) compatible with the current Vite + React setup.",
      "acceptanceCriteria": [
        "The app includes a valid web app manifest linked from the HTML entrypoint.",
        "The manifest references local icon assets in the frontend public directory (no backend image routing).",
        "A service worker is registered in production builds and the app is installable as a PWA on Android Chrome (meeting basic installability requirements)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Link the web app manifest from the HTML entrypoint and add any required PWA meta tags (e.g., theme-color) for installability."
        },
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "create",
          "description": "Add a valid web app manifest configured for the deployed SPA, referencing local icon assets under frontend/public/assets/generated/ and using appropriate start_url/scope/display settings."
        },
        {
          "path": "frontend/public/sw.js",
          "operation": "create",
          "description": "Add a service worker suitable for Vite static builds (basic offline caching strategy for app shell/static assets; avoid push/websocket features per non-goals)."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Register the service worker only for production builds (and handle update/reload behavior safely) so PWA installability works on Android Chrome."
        },
        {
          "path": "frontend/public/assets/generated/yfo-pwa-icon.dim_192x192.png",
          "operation": "create",
          "description": "Add the required generated PWA icon asset at frontend/public/assets/generated/yfo-pwa-icon.dim_192x192.png."
        },
        {
          "path": "frontend/public/assets/generated/yfo-pwa-icon.dim_512x512.png",
          "operation": "create",
          "description": "Add the required generated PWA icon asset at frontend/public/assets/generated/yfo-pwa-icon.dim_512x512.png."
        },
        {
          "path": "frontend/public/assets/generated/yfo-pwa-icon-maskable.dim_512x512.png",
          "operation": "create",
          "description": "Add the required generated maskable PWA icon asset at frontend/public/assets/generated/yfo-pwa-icon-maskable.dim_512x512.png."
        },
        {
          "path": "frontend/public/assets/generated/yfo-apple-touch-icon.dim_180x180.png",
          "operation": "create",
          "description": "Add the required generated Apple touch icon asset at frontend/public/assets/generated/yfo-apple-touch-icon.dim_180x180.png."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Add an install prompt banner on the public Home page that appears only when PWA installation is supported and the app is not already installed.",
      "acceptanceCriteria": [
        "Home page displays an install prompt/banner only when the browser provides an install event (or equivalent installability signal) and the app is not already installed.",
        "Clicking the prompt’s primary action triggers the browser’s install flow (where supported).",
        "All user-facing strings in the install prompt are in English (e.g., title, description, button text, dismiss text).",
        "The prompt can be dismissed and does not reappear excessively during the same session (reasonable UX persistence)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePwaInstallPrompt.ts",
          "operation": "create",
          "description": "Implement a hook that listens for the browser install prompt signal (e.g., beforeinstallprompt), tracks whether the app is already installed (display-mode/standalone checks), and exposes actions to trigger the install flow and to dismiss with session-scoped persistence."
        },
        {
          "path": "frontend/src/components/InstallPromptBanner.tsx",
          "operation": "create",
          "description": "Create a Home-page-friendly install prompt/banner UI component with English text and primary/secondary actions. Use the shadcn-ui components already available in the project (e.g., Card/Button) to match the app design. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Wire the InstallPromptBanner into the public Home page (no new route), ensuring it only renders when install is supported and the app is not already installed, and that dismiss state behaves reasonably within the same session."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Add documentation explaining how to wrap the deployed PWA URL into an Android APK (Trusted Web Activity) without adding unsupported backend services.",
      "acceptanceCriteria": [
        "Repository includes a written guide explaining how to generate an Android APK wrapper for the deployed URL (PWA-to-APK approach).",
        "The guide includes: required tools, where to put the deployed URL, build/sign steps at a high level, and limitations (e.g., Play Store requirements).",
        "The guide does not require adding non-supported backend technologies or third-party auth providers."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/android-apk-from-pwa.md",
          "operation": "create",
          "description": "Write a step-by-step guide for generating an Android APK wrapper for the deployed URL (e.g., using Bubblewrap/Trusted Web Activity), including prerequisites, where to configure the deployed URL, high-level build/sign steps, and limitations/Play Store considerations. Avoid requiring any unsupported backend services or third-party auth providers."
        }
      ]
    }
  ]
}